#2.1 Создайте переменную my_dict и присвойте ей словарь из нескольких пар ключ-значение
my_dict = {'Sasha':1988, 'Masha':1982, 'Denis':1986, 'Mam': 1962}

#2.2 Выведите на экран словарь my_dict.
print('Dict: ',my_dict)

#2.33 Выведите на экран одно значение по существующему ключу,
#                       одно по отсутствующему из словаря my_dict без ошибки.
print('Existing value: ', my_dict['Sasha'])
print('Not existing value: ', my_dict.get('F'))

#2.4 Добавьте ещё две произвольные пары того же формата в словарь my_dict.
my_dict.update({'Pap':1962, 'Mark':2000})

#2.5 Удалите одну из пар в словаре по существующему ключу из словаря my_dict и выведите значение из этой пары на экран.
print('Deleted value: ', my_dict['Sasha'])
del my_dict['Sasha']

#2.6 Выведите на экран словарь my_dict.
print('Modified dictionary: ' , my_dict)
print()

#3.1 Создайте переменную my_set и присвойте ей множество, состоящее из разных типов данных с повторяющимися значениями.
my_set = {1988, 'Yuri', 36.5}

#3.2 Выведите на экран множество my_set (должны отобразиться только уникальные значения).
print('Set: ', my_set)

#3.3 Добавьте 2 произвольных элемента в множество my_set, которых ещё нет.
my_set.add('Example')
my_set.add(1.234)

#3.4 Удалите один любой элемент из множества my_set.
my_set.discard('Yuri')

#3.5 Выведите на экран измененное множество my_set.
print('Modified set: ', my_set)